import volatility.obj as obj
import volatility.plugins.common as common
import volatility.utils as utils
import volatility.win32.tasks as tasks
import volatility.debug as debug
from volatility.renderers import TreeGrid
from volatility.renderers.basic import Address, Hex
MAX_HISTORY_DEFAULT = 50
conhost_types_x86 = {'_COMMAND': [None, {'CmdLength': [0, ['unsigned short']], 'Cmd': [2, ['String', dict(encoding='utf16', length=lambda x: x.CmdLength)]]}], '_COMMAND_HISTORY': [None, {'ListEntry': [0, ['_LIST_ENTRY']], 'Flags': [8, ['Flags', {'bitmap': {'Allocated': 0, 'Reset': 1}}]], 'Application': [12, ['pointer', ['String', dict(encoding='utf16', length=256)]]], 'CommandCount': [16, ['short']], 'LastAdded': [18, ['short']], 'LastDisplayed': [20, ['short']], 'FirstCommand': [22, ['short']], 'CommandCountMax': [24, ['short']], 'ProcessHandle': [28, ['unsigned int']], 'PopupList': [32, ['_LIST_ENTRY']], 'CommandBucket': [40, ['array', lambda x: x.CommandCount, ['pointer', ['_COMMAND']]]]}], '_ALIAS': [None, {'ListEntry': [0, ['_LIST_ENTRY']], 'SourceLength': [8, ['unsigned short']], 'TargetLength': [10, ['unsigned short']], 'Source': [12, ['pointer', ['String', dict(encoding='utf16', length=lambda x: x.SourceLength)]]], 'Target': [16, ['pointer', ['String', dict(encoding='utf16', length=lambda x: x.TargetLength)]]]}], '_EXE_ALIAS_LIST': [None, {'ListEntry': [0, ['_LIST_ENTRY']], 'ExeLength': [8, ['unsigned short']], 'ExeName': [12, ['pointer', ['String', dict(encoding='utf16', length=lambda x: x.ExeLength * 2)]]], 'AliasList': [16, ['_LIST_ENTRY']]}], '_POPUP_LIST': [None, {'ListEntry': [0, ['_LIST_ENTRY']]}], '_CONSOLE_INFORMATION': [None, {'CurrentScreenBuffer': [152, ['pointer', ['_SCREEN_INFORMATION']]], 'ScreenBuffer': [156, ['pointer', ['_SCREEN_INFORMATION']]], 'HistoryList': [212, ['_LIST_ENTRY']], 'ProcessList': [24, ['_LIST_ENTRY']], 'ExeAliasList': [220, ['_LIST_ENTRY']], 'HistoryBufferCount': [228, ['unsigned short']], 'HistoryBufferMax': [230, ['unsigned short']], 'CommandHistorySize': [232, ['unsigned short']], 'OriginalTitle': [236, ['pointer', ['String', dict(encoding='utf16', length=256)]]], 'Title': [240, ['pointer', ['String', dict(encoding='utf16', length=256)]]]}], '_CONSOLE_PROCESS': [None, {'ListEntry': [0, ['_LIST_ENTRY']], 'ProcessHandle': [8, ['unsigned int']]}], '_SCREEN_INFORMATION': [None, {'ScreenX': [8, ['short']], 'ScreenY': [10, ['short']], 'Rows': [60, ['pointer', ['array', lambda x: x.ScreenY, ['_ROW']]]], 'Next': [220, ['pointer', ['_SCREEN_INFORMATION']]]}], '_ROW': [28, {'Chars': [8, ['pointer', ['String', dict(encoding='utf16', length=256)]]]}]}
conhost_types_x64 = {'_COMMAND': [None, {'CmdLength': [0, ['unsigned short']], 'Cmd': [2, ['String', dict(encoding='utf16', length=lambda x: x.CmdLength)]]}], '_COMMAND_HISTORY': [None, {'ListEntry': [0, ['_LIST_ENTRY']], 'Flags': [16, ['Flags', {'bitmap': {'Allocated': 0, 'Reset': 1}}]], 'Application': [24, ['pointer', ['String', dict(encoding='utf16', length=256)]]], 'CommandCount': [32, ['short']], 'LastAdded': [34, ['short']], 'LastDisplayed': [36, ['short']], 'FirstCommand': [38, ['short']], 'CommandCountMax': [40, ['short']], 'ProcessHandle': [48, ['address']], 'PopupList': [56, ['_LIST_ENTRY']], 'CommandBucket': [72, ['array', lambda x: x.CommandCount, ['pointer', ['_COMMAND']]]]}], '_ALIAS': [None, {'ListEntry': [0, ['_LIST_ENTRY']], 'SourceLength': [16, ['unsigned short']], 'TargetLength': [18, ['unsigned short']], 'Source': [24, ['pointer', ['String', dict(encoding='utf16', length=lambda x: x.SourceLength)]]], 'Target': [32, ['pointer', ['String', dict(encoding='utf16', length=lambda x: x.TargetLength)]]]}], '_EXE_ALIAS_LIST': [None, {'ListEntry': [0, ['_LIST_ENTRY']], 'ExeLength': [16, ['unsigned short']], 'ExeName': [24, ['pointer', ['String', dict(encoding='utf16', length=lambda x: x.ExeLength * 2)]]], 'AliasList': [32, ['_LIST_ENTRY']]}], '_POPUP_LIST': [None, {'ListEntry': [0, ['_LIST_ENTRY']]}], '_CONSOLE_INFORMATION': [None, {'ProcessList': [40, ['_LIST_ENTRY']], 'CurrentScreenBuffer': [224, ['pointer', ['_SCREEN_INFORMATION']]], 'ScreenBuffer': [232, ['pointer', ['_SCREEN_INFORMATION']]], 'HistoryList': [328, ['_LIST_ENTRY']], 'ExeAliasList': [344, ['_LIST_ENTRY']], 'HistoryBufferCount': [360, ['unsigned short']], 'HistoryBufferMax': [362, ['unsigned short']], 'CommandHistorySize': [364, ['unsigned short']], 'OriginalTitle': [368, ['pointer', ['String', dict(encoding='utf16', length=256)]]], 'Title': [376, ['pointer', ['String', dict(encoding='utf16', length=256)]]]}], '_CONSOLE_PROCESS': [None, {'ListEntry': [0, ['_LIST_ENTRY']], 'ProcessHandle': [16, ['unsigned int']]}], '_SCREEN_INFORMATION': [None, {'ScreenX': [8, ['short']], 'ScreenY': [10, ['short']], 'Rows': [72, ['pointer', ['array', lambda x: x.ScreenY, ['_ROW']]]], 'Next': [296, ['pointer', ['_SCREEN_INFORMATION']]]}], '_ROW': [40, {'Chars': [8, ['pointer', ['String', dict(encoding='utf16', length=256)]]]}]}
winsrv_types_x86 = {'_COMMAND': [None, {'CmdLength': [0, ['unsigned short']], 'Cmd': [2, ['String', dict(encoding='utf16', length=lambda x: x.CmdLength)]]}], '_COMMAND_HISTORY': [None, {'Flags': [0, ['Flags', {'bitmap': {'Allocated': 0, 'Reset': 1}}]], 'ListEntry': [4, ['_LIST_ENTRY']], 'Application': [12, ['pointer', ['String', dict(encoding='utf16', length=256)]]], 'CommandCount': [16, ['short']], 'LastAdded': [18, ['short']], 'LastDisplayed': [20, ['short']], 'FirstCommand': [22, ['short']], 'CommandCountMax': [24, ['short']], 'ProcessHandle': [28, ['unsigned int']], 'PopupList': [32, ['_LIST_ENTRY']], 'CommandBucket': [40, ['array', lambda x: x.CommandCount, ['pointer', ['_COMMAND']]]]}], '_ALIAS': [None, {'ListEntry': [0, ['_LIST_ENTRY']], 'SourceLength': [8, ['unsigned short']], 'TargetLength': [10, ['unsigned short']], 'Source': [12, ['pointer', ['String', dict(encoding='utf16', length=lambda x: x.SourceLength)]]], 'Target': [16, ['pointer', ['String', dict(encoding='utf16', length=lambda x: x.TargetLength)]]]}], '_EXE_ALIAS_LIST': [None, {'ListEntry': [0, ['_LIST_ENTRY']], 'ExeLength': [8, ['unsigned short']], 'ExeName': [12, ['pointer', ['String', dict(encoding='utf16', length=lambda x: x.ExeLength * 2)]]], 'AliasList': [16, ['_LIST_ENTRY']]}], '_POPUP_LIST': [None, {'ListEntry': [0, ['_LIST_ENTRY']]}], '_CONSOLE_INFORMATION': [None, {'CurrentScreenBuffer': [176, ['pointer', ['_SCREEN_INFORMATION']]], 'ScreenBuffer': [180, ['pointer', ['_SCREEN_INFORMATION']]], 'HistoryList': [264, ['_LIST_ENTRY']], 'ProcessList': [256, ['_LIST_ENTRY']], 'ExeAliasList': [272, ['_LIST_ENTRY']], 'HistoryBufferCount': [280, ['unsigned short']], 'HistoryBufferMax': [282, ['unsigned short']], 'CommandHistorySize': [284, ['unsigned short']], 'OriginalTitle': [292, ['pointer', ['String', dict(encoding='utf16', length=256)]]], 'Title': [296, ['pointer', ['String', dict(encoding='utf16', length=256)]]]}], '_CONSOLE_PROCESS': [None, {'ListEntry': [0, ['_LIST_ENTRY']], 'ProcessHandle': [8, ['unsigned int']], 'Process': [12, ['pointer', ['_CSR_PROCESS']]]}], '_SCREEN_INFORMATION': [None, {'Console': [0, ['pointer', ['_CONSOLE_INFORMATION']]], 'ScreenX': [36, ['short']], 'ScreenY': [38, ['short']], 'Rows': [88, ['pointer', ['array', lambda x: x.ScreenY, ['_ROW']]]], 'Next': [248, ['pointer', ['_SCREEN_INFORMATION']]]}], '_ROW': [28, {'Chars': [8, ['pointer', ['String', dict(encoding='utf16', length=256)]]]}], '_CSR_PROCESS': [96, {'ClientId': [0, ['_CLIENT_ID']], 'ListLink': [8, ['_LIST_ENTRY']], 'ThreadList': [16, ['_LIST_ENTRY']], 'NtSession': [24, ['pointer', ['_CSR_NT_SESSION']]], 'ClientPort': [28, ['pointer', ['void']]], 'ClientViewBase': [32, ['pointer', ['unsigned char']]], 'ClientViewBounds': [36, ['pointer', ['unsigned char']]], 'ProcessHandle': [40, ['pointer', ['void']]], 'SequenceNumber': [44, ['unsigned long']], 'Flags': [48, ['unsigned long']], 'DebugFlags': [52, ['unsigned long']], 'ReferenceCount': [56, ['unsigned long']], 'ProcessGroupId': [60, ['unsigned long']], 'ProcessGroupSequence': [64, ['unsigned long']], 'LastMessageSequence': [68, ['unsigned long']], 'NumOutstandingMessages': [72, ['unsigned long']], 'ShutdownLevel': [76, ['unsigned long']], 'ShutdownFlags': [80, ['unsigned long']], 'Luid': [84, ['_LUID']], 'ServerDllPerProcessData': [92, ['array', 1, ['pointer', ['void']]]]}]}
winsrv_types_x64 = {'_COMMAND': [None, {'CmdLength': [0, ['unsigned short']], 'Cmd': [2, ['String', dict(encoding='utf16', length=lambda x: x.CmdLength)]]}], '_COMMAND_HISTORY': [None, {'Flags': [0, ['Flags', {'bitmap': {'Allocated': 0, 'Reset': 1}}]], 'ListEntry': [8, ['_LIST_ENTRY']], 'Application': [24, ['pointer', ['String', dict(encoding='utf16', length=256)]]], 'CommandCount': [32, ['short']], 'LastAdded': [34, ['short']], 'LastDisplayed': [36, ['short']], 'FirstCommand': [38, ['short']], 'CommandCountMax': [40, ['short']], 'ProcessHandle': [48, ['unsigned int']], 'PopupList': [56, ['_LIST_ENTRY']], 'CommandBucket': [72, ['array', lambda x: x.CommandCount, ['pointer', ['_COMMAND']]]]}], '_ALIAS': [None, {'ListEntry': [0, ['_LIST_ENTRY']], 'SourceLength': [16, ['unsigned short']], 'TargetLength': [18, ['unsigned short']], 'Source': [20, ['pointer', ['String', dict(encoding='utf16', length=lambda x: x.SourceLength)]]], 'Target': [28, ['pointer', ['String', dict(encoding='utf16', length=lambda x: x.TargetLength)]]]}], '_EXE_ALIAS_LIST': [None, {'ListEntry': [0, ['_LIST_ENTRY']], 'ExeLength': [16, ['unsigned short']], 'ExeName': [18, ['pointer', ['String', dict(encoding='utf16', length=lambda x: x.ExeLength * 2)]]], 'AliasList': [26, ['_LIST_ENTRY']]}], '_POPUP_LIST': [None, {'ListEntry': [0, ['_LIST_ENTRY']]}], '_CONSOLE_INFORMATION': [None, {'CurrentScreenBuffer': [232, ['pointer', ['_SCREEN_INFORMATION']]], 'ScreenBuffer': [240, ['pointer', ['_SCREEN_INFORMATION']]], 'HistoryList': [392, ['_LIST_ENTRY']], 'ProcessList': [376, ['_LIST_ENTRY']], 'ExeAliasList': [408, ['_LIST_ENTRY']], 'HistoryBufferCount': [424, ['unsigned short']], 'HistoryBufferMax': [426, ['unsigned short']], 'CommandHistorySize': [428, ['unsigned short']], 'OriginalTitle': [432, ['pointer', ['String', dict(encoding='utf16', length=256)]]], 'Title': [440, ['pointer', ['String', dict(encoding='utf16', length=256)]]]}], '_CONSOLE_PROCESS': [None, {'ListEntry': [0, ['_LIST_ENTRY']], 'ProcessHandle': [16, ['unsigned int']], 'Process': [24, ['pointer', ['_CSR_PROCESS']]]}], '_SCREEN_INFORMATION': [None, {'Console': [0, ['pointer', ['_CONSOLE_INFORMATION']]], 'ScreenX': [40, ['short']], 'ScreenY': [42, ['short']], 'Rows': [104, ['pointer', ['array', lambda x: x.ScreenY, ['_ROW']]]], 'Next': [296, ['pointer', ['_SCREEN_INFORMATION']]]}], '_ROW': [40, {'Chars': [8, ['pointer', ['String', dict(encoding='utf16', length=256)]]]}], '_CSR_PROCESS': [96, {'ClientId': [0, ['_CLIENT_ID']], 'ListLink': [8, ['_LIST_ENTRY']], 'ThreadList': [16, ['_LIST_ENTRY']], 'NtSession': [24, ['pointer', ['_CSR_NT_SESSION']]], 'ClientPort': [28, ['pointer', ['void']]], 'ClientViewBase': [32, ['pointer', ['unsigned char']]], 'ClientViewBounds': [36, ['pointer', ['unsigned char']]], 'ProcessHandle': [40, ['pointer', ['void']]], 'SequenceNumber': [44, ['unsigned long']], 'Flags': [48, ['unsigned long']], 'DebugFlags': [52, ['unsigned long']], 'ReferenceCount': [56, ['unsigned long']], 'ProcessGroupId': [60, ['unsigned long']], 'ProcessGroupSequence': [64, ['unsigned long']], 'LastMessageSequence': [68, ['unsigned long']], 'NumOutstandingMessages': [72, ['unsigned long']], 'ShutdownLevel': [76, ['unsigned long']], 'ShutdownFlags': [80, ['unsigned long']], 'Luid': [84, ['_LUID']], 'ServerDllPerProcessData': [92, ['array', 1, ['pointer', ['void']]]]}]}

class _CONSOLE_INFORMATION(obj.CType):
    """ object class for console information structs """

    def get_histories(self):
        if False:
            i = 10
            return i + 15
        for hist in self.HistoryList.list_of_type('_COMMAND_HISTORY', 'ListEntry'):
            yield hist

    def get_exe_aliases(self):
        if False:
            return 10
        'Generator for exe aliases.\n\n        There is one _EXE_ALIAS_LIST for each executable \n        (i.e. C:\\windows\\system32\\cmd.exe) with registered\n        aliases. The _EXE_ALIAS_LIST.AliasList contains \n        one _ALIAS structure for each specific mapping.\n\n        See GetConsoleAliasExes, GetConsoleAliases, and  \n        AddConsoleAlias. \n        '
        for exe_alias in self.ExeAliasList.list_of_type('_EXE_ALIAS_LIST', 'ListEntry'):
            yield exe_alias

    def get_processes(self):
        if False:
            while True:
                i = 10
        "Generator for processes attached to the console. \n\n        Multiple processes can be attached to the same\n        console (usually as a result of inheritance from a \n        parent process or by duplicating another process's \n        console handle). Internally, they are tracked as \n        _CONSOLE_PROCESS structures in this linked list. \n\n        See GetConsoleProcessList and AttachConsole. \n        "
        for h in self.ProcessList.list_of_type('_CONSOLE_PROCESS', 'ListEntry'):
            yield h

    def get_screens(self):
        if False:
            while True:
                i = 10
        'Generator for screens in the console. \n\n        A console can have multiple screen buffers at a time, \n        but only the current/active one is displayed. \n\n        Multiple screens are tracked using the singly-linked\n        list _SCREEN_INFORMATION.Next. \n    \n        See CreateConsoleScreenBuffer \n        '
        screens = [self.CurrentScreenBuffer]
        if self.ScreenBuffer not in screens:
            screens.append(self.ScreenBuffer)
        for screen in screens:
            cur = screen
            while cur and cur.v() != 0:
                yield cur
                cur = cur.Next.dereference()

class _CONSOLE_PROCESS(obj.CType):
    """ object class for console process """

    def reference_object_by_handle(self):
        if False:
            while True:
                i = 10
        ' Given a process handle, return a reference to \n        the _EPROCESS object. This function is similar to \n        the kernel API ObReferenceObjectByHandle. '
        console_information = self.obj_parent
        parent_process = console_information.obj_parent
        for h in parent_process.ObjectTable.handles():
            if h.HandleValue == self.ProcessHandle:
                return h.dereference_as('_EPROCESS')
        return obj.NoneObject('Could not find process in handle table')

class _SCREEN_INFORMATION(obj.CType):
    """ object class for screen information """

    def get_buffer(self, truncate=True):
        if False:
            print('Hello World!')
        "Get the screen buffer. \n\n        The screen buffer is comprised of the screen's Y \n        coordinate which tells us the number of rows and \n        the X coordinate which tells us the width of each\n        row in characters. These together provide all of \n        the input and output that users see when the \n        console is displayed. \n\n        @param truncate: True if the empty rows at the \n        end (i.e. bottom) of the screen buffer should be \n        supressed.\n        "
        rows = []
        for (_, row) in enumerate(self.Rows.dereference()):
            if row.Chars.is_valid():
                rows.append(str(row.Chars.dereference())[0:self.ScreenX])
        if truncate:
            non_empty_index = 0
            for (index, row) in enumerate(reversed(rows)):
