import volatility.obj as obj
import volatility.plugins.gui.constants as consts
import volatility.plugins.overlays.windows.windows as windows
import volatility.utils as utils
import volatility.addrspace as addrspace
import volatility.conf as conf
import volatility.win32.modules as modules

class _MM_SESSION_SPACE(obj.CType):
    """A class for session spaces"""

    def processes(self):
        if False:
            i = 10
            return i + 15
        'Generator for processes in this session. \n    \n        A process is always associated with exactly\n        one session.\n        '
        for p in self.ProcessList.list_of_type('_EPROCESS', 'SessionProcessLinks'):
            if not p.is_valid():
                break
            yield p

    @property
    def Win32KBase(self):
        if False:
            i = 10
            return i + 15
        "Get the base address of the win32k.sys as mapped \n        into this session's memory. \n\n        Since win32k.sys is always the first image to be \n        mapped, we can just grab the first list entry.\n\n        Update: we no longer use the session image list, because\n        it seems to have gone away in Win8/2012."
        for mod in modules.lsmod(self.obj_vm):
            if str(mod.BaseDllName or '').lower() == 'win32k.sys':
                return mod.DllBase
        return obj.Object('Cannot find win32k.sys base address')

    def images(self):
        if False:
            return 10

        return ''.join(['{0:#x}  {1:<48}  {2}\n'.format(self.abData.obj_offset + o, h, ''.join(c)) for (o, h, c) in utils.Hexdump(data)])

class tagTHREADINFO(tagDESKTOP):
    """A class for thread information objects"""

    def get_params(self):
        if False:
            for i in range(10):
                print('nop')
        'Parameters for the _hooks() function'
        return (self.fsHooks, self.aphkStart)

class tagHOOK(obj.CType):
    """A class for message hooks"""

    def traverse(self):
        if False:
            for i in range(10):
                print('nop')
        'Find the next hook in a chain'
        hook = self
        while hook.is_valid() and hook.v() != 0:
            yield hook
            hook = hook.phkNext.dereference()

class tagEVENTHOOK(obj.CType):
    """A class for event hooks"""

    @property
    def dwFlags(self):
        if False:
            for i in range(10):
                print('nop')
        "Event hook flags need special handling so we can't use vtypes"
        f = self.m('dwFlags') >> 1
        flags = [name for (val, name) in consts.EVENT_FLAGS.items() if f & val == val]
        return '|'.join(flags)

class _RTL_ATOM_TABLE(tagWINDOWSTATION):
    """A class for atom tables"""

    def __init__(self, *args, **kwargs):
        if False:
            return 10
        'Give ourselves an atom cache for quick lookups'
        self.atom_cache = {}
        tagWINDOWSTATION.__init__(self, *args, **kwargs)

    def is_valid(self):
        if False:
            print('Hello World!')
        'Check for validity based on the atom table signature\n        and the maximum allowed number of buckets'
        return obj.CType.is_valid(self) and self.Signature == 1836020801 and (self.NumBuckets < 65535)

    @property
    def NumBuckets(self):
        if False:
            i = 10
            return i + 15
        'Dynamically retrieve the number of atoms in the hash table. \n        First we take into account the offset from the current profile\n        but if it fails and the profile is Win7SP1x64 then we auto set \n        it to the value found in the recently patched versions.\n\n        This is a temporary fix until we have support better support\n        for parsing pdb symbols on the fly. '
        if self.m('NumBuckets') < 65535:
            return self.m('NumBuckets')
        profile = self.obj_vm.profile
        meta = profile.metadata
        major = meta.get('major', 0)
        minor = meta.get('minor', 0)
        build = meta.get('build', 0)
        vers = (major, minor, build)
        if meta.get('memory_model') != '64bit' or vers != (6, 1, 7601):
            return self.m('NumBuckets')
        offset = profile.get_obj_offset('_RTL_ATOM_TABLE', 'NumBuckets')
        number = obj.Object('unsigned long', offset=self.obj_offset + offset + 64, vm=self.obj_vm)
        return number

    def atoms(self):
        if False:
            print('Hello World!')
        'Carve all atoms out of this atom table'
        for bkt in self.Buckets:
            seen = []
            cur = bkt.dereference()
            while cur.is_valid() and cur.v() != 0:
                if cur.obj_offset in seen:
                    break
                yield cur
                seen.append(cur.obj_offset)
                cur = cur.HashLink.dereference()

    def find_atom(self, atom_to_find):
        if False:
            return 10
        'Find an atom by its ID. \n\n        @param atom_to_find: the atom ID (ushort) to find\n\n        @returns an _RTL_ATOM_TALE_ENTRY object \n        '
        if self.atom_cache:
            return self.atom_cache.get(atom_to_find.v(), None)
        self.atom_cache = dict(((atom.Atom.v(), atom) for atom in self.atoms()))
        return self.atom_cache.get(atom_to_find.v(), None)

class _RTL_ATOM_TABLE_ENTRY(obj.CType):
    """A class for atom table entries"""

    @property
    def Pinned(self):
        if False:
            i = 10
            return i + 15
        'Returns True if the atom is pinned'
        return self.Flags == 1

    def is_string_atom(self):
        if False:
            while True:
                i = 10
        'Returns True if the atom is a string atom \n        based on its atom ID. \n        \n        A string atom has ID 0xC000 - 0xFFFF\n        '
        return self.Atom >= 49152 and self.Atom <= 65535

    def is_valid(self):
        if False:
            while True:
                i = 10
        'Perform some sanity checks on the Atom'
        if not obj.CType.is_valid(self):
            return False
        if self.Flags not in (0, 1):
            return False
        return self.NameLength <= 255

class Win32KCoreClasses(obj.ProfileModification):
    """Apply the core object classes"""
    before = ['WindowsObjectClasses']
    conditions = {'os': lambda x: x == 'windows'}

    def modification(self, profile):
        if False:
            for i in range(10):
                print('nop')
        profile.object_classes.update({'tagWINDOWSTATION': tagWINDOWSTATION, 'tagDESKTOP': tagDESKTOP, '_RTL_ATOM_TABLE': _RTL_ATOM_TABLE, '_RTL_ATOM_TABLE_ENTRY': _RTL_ATOM_TABLE_ENTRY, 'tagTHREADINFO': tagTHREADINFO, 'tagHOOK': tagHOOK, '_LARGE_UNICODE_STRING': windows._UNICODE_STRING, 'tagWND': tagWND, '_MM_SESSION_SPACE': _MM_SESSION_SPACE, 'tagSHAREDINFO': tagSHAREDINFO, '_HANDLEENTRY': _HANDLEENTRY, 'tagEVENTHOOK': tagEVENTHOOK, 'tagRECT': tagRECT, 'tagCLIPDATA': tagCLIPDATA})

class Win32KGahtiVType(obj.ProfileModification):
    """Apply a vtype for win32k!gahti. Adjust the number of 
    handles according to the OS version"""
    conditions = {'os': lambda x: x == 'windows'}

    def modification(self, profile):
        if False:
            print('Hello World!')
        version = (profile.metadata.get('major', 0), profile.metadata.get('minor', 0))
        if version >= (6, 1):
            num_handles = len(consts.HANDLE_TYPE_ENUM_SEVEN)
        else:
            num_handles = len(consts.HANDLE_TYPE_ENUM)
        profile.vtypes.update({'gahti': [None, {'types': [0, ['array', num_handles, ['tagHANDLETYPEINFO']]]}]})

class AtomTablex86Overlay(obj.ProfileModification):
    """Apply the atom table overlays for all x86 Windows"""
    before = ['WindowsVTypes']
    conditions = {'os': lambda x: x == 'windows', 'memory_model': lambda x: x == '32bit'}

    def modification(self, profile):
        if False:
            print('Hello World!')
        profile.merge_overlay({'_RTL_ATOM_TABLE': [None, {'Signature': [0, ['unsigned long']], 'NumBuckets': [12, ['unsigned long']], 'Buckets': [16, ['array', lambda x: x.NumBuckets, ['pointer', ['_RTL_ATOM_TABLE_ENTRY']]]]}], '_RTL_ATOM_TABLE_ENTRY': [None, {'Name': [None, ['String', dict(encoding='utf16', length=lambda x: x.NameLength * 2)]]}]})

class AtomTablex64Overlay(obj.ProfileModification):
    """Apply the atom table overlays for all x64 Windows"""
    conditions = {'os': lambda x: x == 'windows', 'memory_model': lambda x: x == '64bit'}

    def modification(self, profile):
        if False:
            for i in range(10):
                print('nop')
        profile.merge_overlay({'_RTL_ATOM_TABLE': [None, {'Signature': [0, ['unsigned long']], 'NumBuckets': [24, ['unsigned long']], 'Buckets': [32, ['array', lambda x: x.NumBuckets, ['pointer', ['_RTL_ATOM_TABLE_ENTRY']]]]}], '_RTL_ATOM_TABLE_ENTRY': [None, {'Name': [None, ['String', dict(encoding='utf16', length=lambda x: x.NameLength * 2)]]}]})

class XP2003x86TimerVType(obj.ProfileModification):
    """Apply the tagTIMER for XP and 2003 x86"""
    conditions = {'os': lambda x: x == 'windows', 'memory_model': lambda x: x == '32bit', 'major': lambda x: x < 6}

    def modification(self, profile):
        if False:
            while True:
                i = 10
        profile.vtypes.update({'tagTIMER': [None, {'head': [0, ['_HEAD']], 'ListEntry': [8, ['_LIST_ENTRY']], 'pti': [16, ['pointer', ['tagTHREADINFO']]], 'spwnd': [20, ['pointer', ['tagWND']]], 'nID': [24, ['unsigned short']], 'cmsCountdown': [28, ['unsigned int']], 'cmsRate': [32, ['unsigned int']], 'flags': [36, ['Flags', {'bitmap': consts.TIMER_FLAGS}]], 'pfn': [40, ['pointer', ['void']]]}]})

class XP2003x64TimerVType(obj.ProfileModification):
    """Apply the tagTIMER for XP and 2003 x64"""
    conditions = {'os': lambda x: x == 'windows', 'memory_model': lambda x: x == '64bit', 'major': lambda x: x < 6}

    def modification(self, profile):
        if False:
            return 10
        profile.vtypes.update({'tagTIMER': [None, {'head': [0, ['_HEAD']], 'ListEntry': [24, ['_LIST_ENTRY']], 'spwnd': [40, ['pointer', ['tagWND']]], 'pti': [32, ['pointer', ['tagTHREADINFO']]], 'nID': [48, ['unsigned short']], 'cmsCountdown': [56, ['unsigned int']], 'cmsRate': [60, ['unsigned int']], 'flags': [64, ['Flags', {'bitmap': consts.TIMER_FLAGS}]], 'pfn': [72, ['pointer', ['void']]]}]})

class Win32Kx86VTypes(obj.ProfileModification):
    """Applies to all x86 windows profiles. 

    These are vtypes not included in win32k.sys PDB.
    """
    conditions = {'os': lambda x: x == 'windows', 'memory_model': lambda x: x == '32bit'}

    def modification(self, profile):
        if False:
            return 10
        profile.vtypes.update({'tagWIN32HEAP': [None, {'Heap': [0, ['_HEAP']]}], 'tagCLIPDATA': [None, {'cbData': [8, ['unsigned int']], 'abData': [12, ['array', lambda x: x.cbData, ['unsigned char']]]}], '_IMAGE_ENTRY_IN_SESSION': [None, {'Link': [0, ['_LIST_ENTRY']], 'Address': [8, ['pointer', ['address']]], 'LastAddress': [12, ['pointer', ['address']]], 'DataTableEntry': [24, ['pointer', ['_LDR_DATA_TABLE_ENTRY']]]}], 'tagEVENTHOOK': [48, {'phkNext': [12, ['pointer', ['tagEVENTHOOK']]], 'eventMin': [16, ['Enumeration', dict(target='unsigned long', choices=consts.EVENT_ID_ENUM)]], 'eventMax': [20, ['Enumeration', dict(target='unsigned long', choices=consts.EVENT_ID_ENUM)]], 'dwFlags': [24, ['unsigned long']], 'idProcess': [28, ['unsigned long']], 'idThread': [32, ['unsigned long']], 'offPfn': [36, ['unsigned long']], 'ihmod': [40, ['long']]}], 'tagHANDLETYPEINFO': [12, {'fnDestroy': [0, ['pointer', ['void']]], 'dwAllocTag': [4, ['String', dict(length=4)]], 'bObjectCreateFlags': [8, ['Flags', {'target': 'unsigned char', 'bitmap': {'OCF_THREADOWNED': 0, 'OCF_PROCESSOWNED': 1, 'OCF_MARKPROCESS': 2, 'OCF_USEPOOLQUOTA': 3, 'OCF_DESKTOPHEAP': 4, 'OCF_USEPOOLIFNODESKTOP': 5, 'OCF_SHAREDHEAP': 6, 'OCF_VARIABLESIZE': 7}}]]}]})

class Win32Kx64VTypes(obj.ProfileModification):
    """Applies to all x64 windows profiles. 

    These are vtypes not included in win32k.sys PDB.
    """
    conditions = {'os': lambda x: x == 'windows', 'memory_model': lambda x: x == '64bit'}

    def modification(self, profile):
        if False:
            i = 10
            return i + 15
        profile.vtypes.update({'tagWIN32HEAP': [None, {'Heap': [0, ['_HEAP']]}], '_IMAGE_ENTRY_IN_SESSION': [None, {'Link': [0, ['_LIST_ENTRY']], 'Address': [16, ['pointer', ['void']]], 'LastAddress': [24, ['pointer', ['address']]], 'DataTableEntry': [32, ['pointer', ['_LDR_DATA_TABLE_ENTRY']]]}], 'tagCLIPDATA': [None, {'cbData': [16, ['unsigned int']], 'abData': [20, ['array', lambda x: x.cbData, ['unsigned char']]]}], 'tagEVENTHOOK': [None, {'phkNext': [24, ['pointer', ['tagEVENTHOOK']]], 'eventMin': [32, ['Enumeration', dict(target='unsigned long', choices=consts.EVENT_ID_ENUM)]], 'eventMax': [36, ['Enumeration', dict(target='unsigned long', choices=consts.EVENT_ID_ENUM)]], 'dwFlags': [40, ['unsigned long']], 'idProcess': [44, ['unsigned long']], 'idThread': [48, ['unsigned long']], 'offPfn': [64, ['unsigned long long']], 'ihmod': [72, ['long']]}], 'tagHANDLETYPEINFO': [16, {'fnDestroy': [0, ['pointer', ['void']]], 'dwAllocTag': [8, ['String', dict(length=4)]], 'bObjectCreateFlags': [12, ['Flags', {'target': 'unsigned char', 'bitmap': {'OCF_THREADOWNED': 0, 'OCF_PROCESSOWNED': 1, 'OCF_MARKPROCESS': 2, 'OCF_USEPOOLQUOTA': 3, 'OCF_DESKTOPHEAP': 4, 'OCF_USEPOOLIFNODESKTOP': 5, 'OCF_SHAREDHEAP': 6, 'OCF_VARIABLESIZE': 7}}]]}]})

class XPx86SessionOverlay(obj.ProfileModification):
    """Apply the ResidentProcessCount overlay for x86 XP session spaces"""
    before = ['WindowsOverlay']
    conditions = {'os': lambda x: x == 'windows', 'memory_model': lambda x: x == '32bit', 'major': lambda x: x == 5, 'minor': lambda x: x == 1}

    def modification(self, profile):
        if False:
            i = 10
            return i + 15
        profile.merge_overlay({'_MM_SESSION_SPACE': [None, {'ResidentProcessCount': [584, ['long']]}]})