import volatility.obj as obj
import volatility.plugins.gui.constants as consts

class XP2003x86BaseVTypes(obj.ProfileModification):
    """Applies to everything x86 before Windows 7"""

    def check(self, profile):
        if False:
            while True:
                i = 10
        m = profile.metadata
        version = (m.get('major', 0), m.get('minor', 0))
        return m.get('os', None) == 'windows' and version < (6, 1) and (m.get('memory_model', '32bit') == '32bit')

    def modification(self, profile):
        if False:
            print('Hello World!')
        profile.vtypes.update({'tagWINDOWSTATION': [92, {'dwSessionId': [0, ['unsigned long']], 'rpwinstaNext': [4, ['pointer', ['tagWINDOWSTATION']]], 'rpdeskList': [8, ['pointer', ['tagDESKTOP']]], 'dwWSF_Flags': [16, ['unsigned long']], 'ptiDrawingClipboard': [28, ['pointer', ['tagTHREADINFO']]], 'spwndClipOpen': [32, ['pointer', ['tagWND']]], 'spwndClipViewer': [36, ['pointer', ['tagWND']]], 'spwndClipOwner': [40, ['pointer', ['tagWND']]], 'pClipBase': [44, ['pointer', ['array', lambda x: x.cNumClipFormats, ['tagCLIP']]]], 'cNumClipFormats': [48, ['unsigned int']], 'iClipSerialNumber': [52, ['unsigned int']], 'iClipSequenceNumber': [56, ['unsigned int']], 'pGlobalAtomTable': [64, ['pointer', ['void']]]}], 'tagCLIP': [12, {'fmt': [0, ['Enumeration', dict(target='unsigned long', choices=consts.CLIPBOARD_FORMAT_ENUM)]], 'hData': [4, ['unsigned int']], 'fGlobalHandle': [8, ['unsigned int']]}], 'tagDESKTOP': [132, {'dwSessionId': [0, ['unsigned long']], 'pDeskInfo': [4, ['pointer', ['tagDESKTOPINFO']]], 'rpdeskNext': [12, ['pointer', ['tagDESKTOP']]], 'rpwinstaParent': [16, ['pointer', ['tagWINDOWSTATION']]], 'hsectionDesktop': [64, ['pointer', ['void']]], 'pheapDesktop': [68, ['pointer', ['tagWIN32HEAP']]], 'PtiList': [100, ['_LIST_ENTRY']]}], 'tagTHREADINFO': [None, {'pEThread': [0, ['pointer', ['_ETHREAD']]], 'ppi': [44, ['pointer', ['tagPROCESSINFO']]], 'pq': [48, ['pointer', ['tagQ']]], 'pDeskInfo': [64, ['pointer', ['tagDESKTOPINFO']]], 'PtiLink': [172, ['_LIST_ENTRY']], 'fsHooks': [152, ['unsigned long']], 'aphkStart': [244, ['array', 16, ['pointer', ['tagHOOK']]]]}], 'tagQ': [None, {'mlInput': [0, ['tagMLIST']]}], 'tagMLIST': [None, {'pqmsgRead': [0, ['pointer', ['tagQMSG']]], 'cMsgs': [8, ['unsigned long']]}], 'tagQMSG': [None, {'pqmsgNext': [0, ['pointer', ['tagQMSG']]], 'pqmsgPrev': [4, ['pointer', ['tagQMSG']]], 'msg': [8, ['tagMSG']]}], 'tagMSG': [None, {'hwnd': [0, ['unsigned long']], 'message': [4, ['unsigned long']], 'wParam': [8, ['unsigned long']], 'lParam': [12, ['unsigned long']], 'time': [16, ['unsigned long']], 'pt': [20, ['tagPOINT']]}], 'tagPOINT': [None, {'x': [0, ['long']], 'y': [4, ['long']]}], 'tagHOOK': [None, {'head': [0, ['_THRDESKHEAD']], 'phkNext': [20, ['pointer', ['tagHOOK']]], 'iHook': [24, ['long']], 'offPfn': [28, ['unsigned long']], 'flags': [32, ['Flags', {'bitmap': consts.HOOK_FLAGS}]], 'ihmod': [36, ['long']], 'ptiHooked': [40, ['pointer', ['tagTHREADINFO']]], 'rpdesk': [44, ['pointer', ['tagDESKTOP']]]}], 'tagDESKTOPINFO': [None, {'pvDesktopBase': [0, ['pointer', ['void']]], 'pvDesktopLimit': [4, ['pointer', ['void']]], 'spwnd': [8, ['pointer', ['tagWND']]], 'fsHooks': [12, ['unsigned long']], 'aphkStart': [16, ['array', 16, ['pointer', ['tagHOOK']]]]}], 'tagSERVERINFO': [4092, {'cHandleEntries': [8, ['unsigned long']], 'cbHandleTable': [444, ['unsigned long']]}], 'tagSHAREDINFO': [284, {'psi': [0, ['pointer', ['tagSERVERINFO']]], 'aheList': [4, ['pointer', ['_HANDLEENTRY']]], 'ulSharedDelta': [12, ['unsigned long']]}], '_HANDLEENTRY': [12, {'phead': [0, ['pointer', ['_HEAD']]], 'pOwner': [4, ['pointer', ['void']]], 'bType': [8, ['Enumeration', dict(target='unsigned char', choices=consts.HANDLE_TYPE_ENUM)]], 'bFlags': [9, ['unsigned char']], 'wUniq': [10, ['unsigned short']]}], '_HEAD': [8, {'h': [0, ['pointer', ['void']]], 'cLockObj': [4, ['unsigned long']]}], 'tagPROCESSINFO': [None, {'Process': [0, ['pointer', ['_EPROCESS']]]}], '_THRDESKHEAD': [20, {'h': [0, ['pointer', ['void']]], 'cLockObj': [4, ['unsigned long']], 'pti': [8, ['pointer', ['tagTHREADINFO']]], 'rpdesk': [12, ['pointer', ['tagDESKTOP']]], 'pSelf': [16, ['pointer', ['unsigned char']]]}], 'tagCLS': [92, {'pclsNext': [0, ['pointer', ['tagCLS']]], 'atomClassName': [4, ['unsigned short']], 'atomNVClassName': [6, ['unsigned short']]}], 'tagRECT': [16, {'left': [0, ['long']], 'top': [4, ['long']], 'right': [8, ['long']], 'bottom': [12, ['long']]}], 'tagWND': [164, {'head': [0, ['_THRDESKHEAD']], 'ExStyle': [28, ['unsigned long']], 'style': [32, ['unsigned long']], 'hModule': [36, ['pointer', ['void']]], 'spwndNext': [44, ['pointer', ['tagWND']]], 'spwndPrev': [48, ['pointer', ['tagWND']]], 'spwndParent': [52, ['pointer', ['tagWND']]], 'spwndChild': [56, ['pointer', ['tagWND']]], 'spwndOwner': [60, ['pointer', ['tagWND']]], 'rcWindow': [64, ['tagRECT']], 'rcClient': [80, ['tagRECT']], 'lpfnWndProc': [96, ['pointer', ['void']]], 'pcls': [100, ['pointer', ['tagCLS']]], 'strName': [128, ['_LARGE_UNICODE_STRING']], 'cbwndExtra': [140, ['long']], 'dwUserData': [152, ['unsigned long']]}], '_LARGE_UNICODE_STRING': [12, {'Length': [0, ['unsigned long']], 'MaximumLength': [4, ['BitField', dict(start_bit=0, end_bit=31)]], 'bAnsi': [4, ['BitField', dict(start_bit=31, end_bit=32)]], 'Buffer': [8, ['pointer', ['unsigned short']]]}]})

class XP2003x64BaseVTypes(obj.ProfileModification):
    """Applies to Windows XP and 2003 x64"""
    conditions = {'os': lambda x: x == 'windows', 'memory_model': lambda x: x == '64bit', 'major': lambda x: x < 6}

    def modification(self, profile):
        if False:
            i = 10
            return i + 15
        profile.vtypes.update({'tagWINDOWSTATION': [144, {'dwSessionId': [0, ['unsigned long']], 'rpwinstaNext': [8, ['pointer64', ['tagWINDOWSTATION']]], 'rpdeskList': [16, ['pointer64', ['tagDESKTOP']]], 'dwWSF_Flags': [32, ['unsigned long']], 'ptiDrawingClipboard': [56, ['pointer64', ['tagTHREADINFO']]], 'spwndClipOpen': [64, ['pointer64', ['tagWND']]], 'spwndClipViewer': [72, ['pointer64', ['tagWND']]], 'spwndClipOwner': [80, ['pointer64', ['tagWND']]], 'pClipBase': [88, ['pointer64', ['array', lambda x: x.cNumClipFormats, ['tagCLIP']]]], 'cNumClipFormats': [96, ['unsigned int']], 'iClipSerialNumber': [100, ['unsigned int']], 'iClipSequenceNumber': [104, ['unsigned int']], 'pGlobalAtomTable': [112, ['pointer64', ['void']]]}], 'tagCLIP': [24, {'fmt': [0, ['Enumeration', dict(target='unsigned long', choices=consts.CLIPBOARD_FORMAT_ENUM)]], 'hData': [8, ['pointer64', ['void']]], 'fGlobalHandle': [16, ['long']]}], 'tagDESKTOP': [208, {'dwSessionId': [0, ['unsigned long']], 'pDeskInfo': [8, ['pointer64', ['tagDESKTOPINFO']]], 'rpdeskNext': [24, ['pointer64', ['tagDESKTOP']]], 'rpwinstaParent': [32, ['pointer64', ['tagWINDOWSTATION']]], 'hsectionDesktop': [112, ['pointer64', ['void']]], 'pheapDesktop': [120, ['pointer64', ['tagWIN32HEAP']]], 'PtiList': [160, ['_LIST_ENTRY']]}], 'tagTHREADINFO': [None, {'pEThread': [0, ['pointer', ['_ETHREAD']]], 'ppi': [104, ['pointer64', ['tagPROCESSINFO']]], 'pDeskInfo': [144, ['pointer64', ['tagDESKTOPINFO']]], 'PtiLink': [352, ['_LIST_ENTRY']], 'fsHooks': [312, ['unsigned long']], 'aphkStart': [320, ['array', 16, ['pointer64', ['tagHOOK']]]]}], 'tagDESKTOPINFO': [None, {'pvDesktopBase': [0, ['pointer64', ['void']]], 'pvDesktopLimit': [8, ['pointer64', ['void']]], 'spwnd': [16, ['pointer64', ['tagWND']]], 'fsHooks': [24, ['unsigned long']], 'aphkStart': [32, ['array', 16, ['pointer64', ['tagHOOK']]]]}], 'tagWND': [None, {'head': [0, ['_THRDESKHEAD']], 'ExStyle': [48, ['unsigned long']], 'style': [52, ['unsigned long']], 'spwndNext': [72, ['pointer64', ['tagWND']]], 'spwndPrev': [80, ['pointer64', ['tagWND']]], 'spwndParent': [88, ['pointer64', ['tagWND']]], 'spwndChild': [96, ['pointer64', ['tagWND']]], 'spwndOwner': [104, ['pointer64', ['tagWND']]], 'rcWindow': [112, ['tagRECT']], 'rcClient': [128, ['tagRECT']], 'lpfnWndProc': [144, ['pointer64', ['void']]], 'pcls': [152, ['pointer64', ['tagCLS']]], 'strName': [208, ['_LARGE_UNICODE_STRING']]}], 'tagRECT': [16, {'left': [0, ['long']], 'top': [4, ['long']], 'right': [8, ['long']], 'bottom': [12, ['long']]}], 'tagCLS': [None, {'pclsNext': [0, ['pointer64', ['tagCLS']]], 'atomClassName': [8, ['unsigned short']], 'atomNVClassName': [10, ['unsigned short']]}], '_LARGE_UNICODE_STRING': [16, {'Length': [0, ['unsigned long']], 'MaximumLength': [4, ['BitField', dict(start_bit=0, end_bit=31, native_type='unsigned long')]], 'bAnsi': [4, ['BitField', dict(start_bit=31, end_bit=32, native_type='unsigned long')]], 'Buffer': [8, ['pointer64', ['unsigned short']]]}], '_THRDESKHEAD': [40, {'h': [0, ['pointer64', ['void']]], 'cLockObj': [8, ['unsigned long']], 'pti': [16, ['pointer64', ['tagTHREADINFO']]], 'rpdesk': [24, ['pointer64', ['tagDESKTOP']]], 'pSelf': [32, ['pointer64', ['unsigned char']]]}], 'tagSHAREDINFO': [None, {'psi': [0, ['pointer64', ['tagSERVERINFO']]], 'aheList': [8, ['pointer64', ['_HANDLEENTRY']]], 'ulSharedDelta': [24, ['unsigned long long']]}], '_HANDLEENTRY': [24, {'phead': [0, ['pointer64', ['_HEAD']]], 'pOwner': [8, ['pointer64', ['void']]], 'bType': [16, ['Enumeration', dict(target='unsigned char', choices=consts.HANDLE_TYPE_ENUM)]], 'bFlags': [17, ['unsigned char']], 'wUniq': [18, ['unsigned short']]}], '_HEAD': [16, {'h': [0, ['pointer64', ['void']]], 'cLockObj': [8, ['unsigned long']]}], 'tagSERVERINFO': [None, {'cHandleEntries': [8, ['unsigned long']], 'cbHandleTable': [816, ['unsigned long']]}], 'tagPROCESSINFO': [None, {'Process': [0, ['pointer', ['_EPROCESS']]]}], 'tagHOOK': [96, {'head': [0, ['_THRDESKHEAD']], 'phkNext': [40, ['pointer64', ['tagHOOK']]], 'iHook': [48, ['long']], 'offPfn': [56, ['unsigned long long']], 'flags': [64, ['Flags', {'bitmap': consts.HOOK_FLAGS}]], 'ihmod': [68, ['long']], 'ptiHooked': [72, ['pointer64', ['tagTHREADINFO']]], 'rpdesk': [80, ['pointer64', ['tagDESKTOP']]], 'nTimeout': [88, ['BitField', dict(start_bit=0, end_bit=7, native_type='unsigned long')]], 'fLastHookHung': [88, ['BitField', dict(start_bit=7, end_bit=8, native_type='long')]]}]})